<template>
  <div>
    <h1>Главная страница</h1>
    <p>Фронтенд приложение</p>
    <p>Технологии:</p>
    Vue
    <ul>
      <li>Vue + nuxt</li>
      <li>Element ul или Bootstrap 3</li>
    </ul>
    Задачи:
    <ul>
      <li>Приложение будет состоять из 2 областей: "левое меню (Список автомобилей, Пользователь)" и "контентная область"</li>
      <li>В левом меню будут 2 сущности:</li>
      <li>Cars (Список автомобилей)</li>
      <li>Users (Пользователь)</li>
      <li>Функционал страниц для каждой из сущностей:</li>
      <li>Страница списка выбранной сущности.</li>
      <li>Страница редактирования выбранной сущности.</li>
      <li>Страница просмотра сущности.</li>
      <li>Страница создания сущности.</li>
      <li>Удаление выбранной сущности.</li>
    </ul>
  </div>
</template>

<script>
export default {
  name: 'IndexPage'
}
</script>
<style lang="scss" scoped>
h1 {
  margin:0
}
</style>
